Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSearch
The current search in a Document

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSearch.Changed
Occurs when the Search contained in this object has changed

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSearch.Changing
Occurs when the Search contained in this object is about to change

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSearch.Clear
Clears the current search

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSearch.CopyFrom(Autodesk.Navisworks.Api.Search)
Copies the Search from search

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSearch.CreateCopy
Creates a copy of the Search associated with this object

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSearch.IsClear
Returns true when there is no selection or search conditions in the search

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSearch.op_Implicit(Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSearch)~Autodesk.Navisworks.Api.Search
Conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSearch.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSearch.ToSearch
Explicit form of conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSearch.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSearch.Value
The value of the current search within the document